EnglishMorse = {'a': ".-", 'b': "-...", 'c': "-.-.", 'd': "-..", 'e': ".", 'f': "..-.",
                'g': "--.", 'h': "....", 'i': "..", 'j': ".---", 'k': "-.-", 'l': ".-..",
                'm': "--", 'n': "-.", 'o': "---", 'p': ".--.", 'q': "--.-", 'r': ".-.",
                's': "...", 't': "-", 'u': "..-", 'v': "...-", 'w': ".--", 'x': "-..-",
                'y': "-.--", 'z': "--.."}

RussianMorse = {'а': ".-", 'б': "-...", 'в': ".--", 'г': "--.", 'д': "-..", 'е': ".", 'ё': ".",
                'ж': "...-", 'з': "--..", 'и': "..", 'й': ".---", 'к': "-.-", 'л': ".-..",
                'м': "--", 'н': "-.", 'о': "---", 'п': ".--.", 'р': ".-.", 'с': "...",
                'т': "-", 'у': "..-", 'ф': "..-.", 'х': "....", 'ц': "-.-.", 'ч': "---.",
                'ш': "----", 'щ': "--.-", 'ъ': ".--.-.", 'ы': "-.--", 'ь': "-..-", 'э': "..-..",
                'ю': "..--", 'я': ".-.-"}

EnglishMorse_back = {".-": 'a', "-...": 'b', "-.-.": 'c', "-..": 'd', ".": 'e', "..-.": 'f',
                     "--.": 'g', "....": 'h', "..": 'i', ".---": 'j', "-.-": 'k', ".-..": 'l',
                     "--": 'm', "-.": 'n', "---": 'o', ".--.": 'p', "--.-": 'q', ".-.": 'r',
                     "...": 's', "-": 't', "..-": 'u', "...-": 'v', ".--": 'w', "-..-": 'x',
                     "-.--": 'y', "--..": 'z'}

RussianMorse_back = {".-": 'а', "-...": 'б', ".--": 'в', "--.": 'г', "-..": 'д', ".": 'е',
                     "...-": 'ж', "--..": 'з', "..": 'и', ".---": 'й', "-.-": 'к', ".-..": 'л',
                     "--": 'м', "-.": 'н', "---": 'о', ".--.": 'п', ".-.": 'р', "...": 'с',
                     "-": 'т', "..-": 'у', "..-.": 'ф', "....": 'х', "-.-.": 'ц', "---.": 'ч',
                     "----": 'ш', "--.-": 'щ', ".--.-.": 'ъ', "-.--": 'ы', "-..-": 'ь', "..-..": 'э',
                     "..--": 'ю', ".-.-": 'я'}

def code_morse(word, language):
    final_word = ''
    for letter in word:
        if language == 'russian':
            letter = RussianMorse.get(letter)
        elif language == 'english':
            letter = EnglishMorse.get(letter)
        final_word = final_word + letter + ' '
    return final_word


def decode_morse(word, language):
    final_word = ''
    letters = word.split()
    for letter in letters:

        if language == 'russian':
            letter = RussianMorse_back.get(letter)
        elif language == 'english':
            letter = EnglishMorse_back.get(letter)
        final_word += letter
    return final_word